GREETING = '''
<b>Доброго времени суток!</b>

С тобой говорит твой личный помощник в тренировках и организатор твоего лучшего тренировочного процесса!

Могу помочь составить тебе программу тренировок 🏋🏽, дать совет 🧘🏽‍♂️, либо порекомендовать курсы тренировок профессиональных атлетов 🎭.

Начнём или рассказать подробнее обо мне?
'''

ABOUT_BOT = '''
Меня разработал человек, имеющий определенные значения в тренировках, питании и желающий ими поделиться 💪.

Мой создатель получил много опыта и знаний, которые он вложил в меня, чтобы я мог помочь тебе достичь новых высот! 📈

Расскажи мне малость о себе и выбери свою цель. Далее мы проведем с тобой пробную тренировку и я смогу создавать программу тренировок и питания исключительно под тебя!
'''

ABOUT_BOT_SKILLS = '''
Я могу составить тебе тренировку по выбранному плану и дать совет насчет ее прохождения, а также питания. Еще я веду статистику твоих тренировок и создаю персональный рейтинг! 🤩

И конечно, если захочешь, могу напоминать тебе, что пора потренироваться 😈
'''

FIRST_ENTER_DATA = '''
Для того чтобы я мог составить тренировку, которая максимально нагрузила твои мышцы, при том что ты остался в общем и целом в здравии, придется попотеть и поделиться со мной твоими успехами и данными.

Расскажи о себе.
'''

QUESTION_GENDER = '''
Какой твой пол?
'''

QUESTION_AGE = '''
Сколько тебе лет?
'''

QUESTION_HEIGHT = '''
Твой рост в сантиметрах?
'''

QUESTION_WEIGHT = '''
Твой вес в килограммах?
'''

QUESTION_GOAL = '''
Какова цель твоих тренировок?
'''
# 1. Набрать мышечную массу
# 2. Поддержка формы
# 3. Стать гибче
# 4. Стать выносливее
# '''

USER_AGREEMENT_ENTER_QUESTION = '''
Теперь осталость прочитать пользовательское соглашение.
При согласии продолжим.
'''

END_BEGINNING_QUIZ = '''
Добро пожаловать в команду! 🤝
'''


POLICY_FOR_DEVELOPMENT = '''
На данный момент проект находится в разработке!

Каждый пользователь должен отдавать себе отчёт в том, что он является тестировщиком проекта.

Также разработчики проекта не несут никакой ответственности за здоровье пользователя!

В свою очередь пользовательские данные, которые пользователь сохраняет в проекте используются исключительно для улучшения системы подбора тренировок.

Рационы и программы тренировок имеют рекомендательных характер!
'''

BAD_ENTER_USER_DATA = '''
Приложение подготавливает тренировки для групп лиц имеющей физические данные в заданных диапазонах!'''

MAIN_MENU = '''
Пора делать вещи! Выбирай, чем мы сейчас займёмся?
'''
# 1. Потренироваться
# 2. План питания
# 3. Настройки/Получить помощь
# 4. Прогресс
# '''
# Получить мудрость черепахи)

CHOICE_ACTION_TRAIN = '''
В разделе тренировки ты можешь:
• Создать свою тренировку.
• Сгенирировать тренировку.
• Пройти тестовую тренироку.
'''

# CHOICE_ACTION_TRAIN = '''
# В разделе тренировки ты можешь:
# 1. Создать свою тренировку
# 2. Сгенирировать тренировку
# 3. Пройти тестовую тренироку
# 4. Вернуться назад
# '''

BEGIN_TEST_TRAIN = '''
Приступим к тестированию.
Будь готов пробежаться 🏃 и подтянуться на турнике 🏋️‍♀️
В случае отсутствия возможности прохождения каких-либо упражнений.
можно вписать примерные показатели, однако для корректной работы нейросети рекомендуется выполнение всех упражнений.

Продолжаем?
'''

PUSH_UP_TEST = '''
Введите максимальное количество отжиманий от пола за один подход?
'''

RUNNING_3KM_TEST = '''
За какое время ты пробегаешь 3 км?
'''

SQUAT_TEST = '''
Введите максимальное количество приседаний за один подход?
'''

PRESS_TEST = '''
Введите максимальное количество подъемов туловища(пресс) за один подход?
'''

PULL_UP_TEST = '''
Введите максимальное количество подтягиваний(обычным хватом) за один подход?
'''

COMPLETE_TEST_TRAIN = '''
Поздравляю тебя 🥳
Ты прошел тестовую тренировку и теперь алгоритмы и нейросети смогут составить тебе тренировку.
'''

WARNING_TEST_TRAIN = '''
Чтобы нейросети смогли сгенерировать программу, необходимо пройти тестовую тренировку❗️
Это нужно для того, чтобы нейросеть 🌐 корректно подобрала количество упражнений в подходе.'''


WARNING_USER_TRAIN = '''
Пользовательская тренирвока не создана❗️
'''

WARNING_MANY_WORKOUTS_TODAY = '''
Ты сделал за последние 24 часа больше 3 тренировок 😱. Отдохни малехо.'''


CHOICE_FEELING = '''
Перед тем как сгенерировать тренировку, мне нужно узнать твое самочувствие.
'''


CHOICE_TRAIN = '''
На выбор три тренировки:
⚡️ страя, займет ~ 30-40 мин
⚡️ стандартная, длится ~ 1ч 30 мин
⚡️ растяжка, расчитана на ~ 20-30 мин
И если вы желаете вернуться - назад
'''

FAST_TRAIN = '''
Приступим к быстрой тренировке 🥸.
Прилагаю выполнить комплекс ниже:
'''

STANDART_TRAIN = '''
Приступим к стандартной тренировке 😎.
Прилагаю выполнить комплекс ниже:
'''

STRATCHING = '''
Приступим к растяжке 😥.
Прилагаю выполнить комплекс ниже:
'''


USER_WORKOUT = '''
Приступим к выполнению созданной вами тренировки 🎯.
Прилагаю выполнить комплекс ниже:
'''

# Питание
CHOICE_FOOD = '''
Выберите рацион для генерации:
• Завтрак 🥪
• Перекус 🥛
• Обед 🍝
• Полдник 🍶
• Ужин 🫕
• Перед сном 🍵
• На день 🍴
И если вы желаете вернуться - назад.'''


BAD_ENTER = '''
Я всего лишь бот и не знаю что ответить на ваш нестандартный запрос 🫣.
'''


STATIC_TRAIN_EXERCISE_DESCRIPTION = '''

Рекомендуется выполнять 2-3 подхода на максимальное время.
'''

EMOM_EXERCISE_DESCRIPTION = '''

Необходимо вывести все рабочие упражнения! (Интерфейс дорабатывается),
затем на протяжении нескольких минут (макс до 10) в одной минуте делать сначала одно упражнение,
потом сразу другое, оставшееся время в минуте отдыхать.
'''

CROSSFIT_DESCRIPTION = '''

Рекомендуется выполнять по 5 подходов, с минимально фиксированным отдыхом.
'''

STANDART_TRAIN_DESCRIPTION = '''

Рекомендуется выполнять 3-4 подхода, первый подход - разминочный.
Отдых между подходами стараться соблюдать от 1 до 3 мин.
'''

VIEW_USER_RATE = '''
Ваш показатель активности 🎖
'''

ADD_USER_RATE = '''
Тренировка успешно пройдена 👍
Сейчас предлагаю тебе оставить свой отзыв о тренировке.
Это поможет сделать рекомендации и программы лучше 💪
'''
# DAY_RATION = ''''''

MENU_SETTING = '''
В меню настроек вы можете изменить свои параметры, либо обратиться за помощью.
'''

MENU_USER_SETTING = '''
Выберите параметр для редактирования:
• Пол 👫
• Возраст 📆
• Вес ⚖️
• Рост 📏
• Цель 🎯
Для просмотра своих данных выберите Мои данные..
И если вы желаете вернуться - назад.'''

SUPPORT = '''
Сервис на данный момент работает в тестовом режиме!
По всем вопросам писать на почту разработчка: miroslav.kuzin1@yandex.ru'''

VIEW_GRAPHIC = '''
Ваш график тренировок в этом месяце.
'''

VIEW_GRAPHIC_ERROR = '''
У вас еще нет тренировок в этом месяце.
'''

ADDED_USER_WORKOUT = '''
Ваша тренировка сохранена.
'''

ADD_USER_WORKOUT_ERROR = '''
Ошибка добавления! Количестводобавленных тренировок больше 10.'''

ADD_USER_WORKOUT_NULL_ERROR = '''
Вы не выбрали упражения! Данные не сохранены!
'''